Repository: common-repository/pdpa-thailand
Catalog: languages/pdpa-thailand-*.po
Languages: th

source: <label>Shortcode</label>[dpdpa_policy_page title="Cookies policy"] For showing link to policy page<br>[dpdpa_settings title="Cookie settings"] For calling sidebar and show cookie settings or Enable settings button ( Tab General )
th: <label>Shortcode</label>[dpdpa_policy_page title="Cookies policy"] สำหรับแสดงลิงก์เพื่อไปยังหน้า Policy<br> [dpdpa_settings title="Cookie settings"] สำหรับแสดงลิงก์เพื่อเรียก Sidebar และรายการ Cookie มาแสดง หรือ เปิด ปุ่มตั้งค่าได้ที่ ( แท็บ General )

source: <strong>Designil PDPA Thailand</strong> If you’re enjoying our plugin, we would greatly appreciate a <span class="star">★★★★★</span> rating! Your support means the world to us!
th: <strong>Designil PDPA Thailand</strong> หากคุณพึงพอใจกับปลั๊กอินของเรา เราจะรู้สึกขอบคุณอย่างยิ่งหากคุณให้คะแนน <span class="star">★★★★★</span> 🙏

source: Accept button color
th: สีของปุ่มยอมรับ

source: Add cookies <span class="pdpa--thailand-pro">PRO</span>
th: เพิ่มคุกกี้ <span class="pdpa--thailand-pro">PRO</span>

source: Allow
th: ยอมรับ

source: Allow All
th: ยอมรับทั้งหมด

source: Allow All button <span class="pdpa--thailand-pro">PRO</span>
th: ปุ่มอนุญาตทั้งหมด <span class="pdpa--thailand-pro">PRO</span>

source: Allow button <span class="pdpa--thailand-pro">PRO</span>
th: ปุ่มอนุญาต <span class="pdpa--thailand-pro">PRO</span>

source: Allows grouping of cookies before and after consent is provided.
th: อนุญาตให้จัดกลุ่มคุกกี้ก่อนและหลังการให้ความยินยอม

source: Always Active
th: เปิดใช้งานตลอด

source: Appearance
th: การแสดงผล

source: BG blur & transparent <span class="pdpa--thailand-pro">PRO</span>
th: การเบลอพื้นหลังและโปร่งใส <span class="pdpa--thailand-pro">PRO</span>

source: Blend in
th: ผสมผสาน

source: Bottom to top
th: จากล่างขึ้นบน

source: Bottom to top & Fade
th: จากล่างขึ้นบน และค่อยๆ ปรากฏขึ้น

source: Box Bottom Left
th: กล่องมุมซ้ายล่าง

source: Box Bottom Right
th: กล่องมุมขวาล่าง

source: Box Top Left
th: กล่องมุมขวาบน

source: Box Top Right
th: สามารถตั้งค่าโดยใช้ป๊อปอัปและรีเซ็ต ID ของคุกกี้ได้

source: Capable of setting up using a popup and resetting the cookie ID.
th: สามารถตั้งค่าโดยใช้ป๊อปอัปและรีเซ็ต ID ของคุกกี้ได้

source: Center Bottom
th: กึ่งกลางล่าง

source: Center Top
th: กึ่งกลางบน

source: Code before &lt;/body&gt; <span class="pdpa--thailand-pro">PRO</span>
th: Code ก่อนปิด &lt;/body&gt; <span class="pdpa--thailand-pro">PRO</span>

source: Code in &lt;head&gt;&lt;/head&gt; <span class="pdpa--thailand-pro">PRO</span>
th: Code ใน &lt;head&gt;&lt;/head&gt; <span class="pdpa--thailand-pro">PRO</span>

source: Code inside the boxes below will run <u>after</u> user's consent
th: โค้ดภายในช่องนี้จะทำงาน <u>หลัง</u> ผู้ใช้ให้ความยินยอมเท่านั้น

source: Code inside the boxes below will run <u>before</u> user's consent
th: โค้ดภายในช่องนี้จะทำงาน <u>ก่อน</u>ผู้ใช้ให้ความยินยอมเท่านั้น

source: Code next to &lt;body&gt; <span class="pdpa--thailand-pro">PRO</span>
th: Code ถัดจาก &lt;body&gt; <span class="pdpa--thailand-pro">PRO</span>

source: Consent description *
th: รายละเอียดความยินยอม

source: Consent title *
th: ประเภทการยินยอม *

source: Cookie consent message
th: ข้อความ ขอความยินยอม

source: Cookie name *
th: ชื่อคุกกี้ *

source: Cookies
th: คุกกี้

source: Cookies Detail <span class="pdpa--thailand-pro">PRO</span>
th: รายละเอียดคุกกี้ <span class="pdpa--thailand-pro">PRO</span>

source: Cookies duration <span class="pdpa--thailand-pro">PRO</span>
th: ระยะเวลาคุกกี้ <span class="pdpa--thailand-pro">PRO</span>

source: Cookies list <a href="%s" class="pdpa--link" target="_blank"></a>
th: รายการคุกกี้ <a href="%s" class="pdpa--link" target="_blank"></a>

source: Cookies settings
th: ตั้งค่าคุกกี้

source: Customizes every button text.
th: ปรับแต่งข้อความของปุ่มทั้งหมด

source: Cutie
th: น่ารัก

source: Days
th: วัน

source: Default Mode
th: โหมดเริ่มต้น

source: Disable auto-check cookies <span class="pdpa--thailand-pro">PRO</span>
th: ปิดการตรวจสอบคุกกี้อัตโนมัติ <span class="pdpa--thailand-pro">PRO</span>

source: Displays a message in a popup, sidebar, or necessary cookie.
th: แสดงข้อความในป๊อปอัป, แถบด้านข้าง, หรือคุกกี้ที่จำเป็น

source: Documentaion
th: คู่มือการใช้งาน

source: Enable admin only mode <span class="pdpa--thailand-pro">PRO</span>
th: เปิดใช้งานโหมดสำหรับแอดมินเท่านั้น <span class="pdpa--thailand-pro">PRO</span>

source: Enable always on <span class="pdpa--thailand-pro">PRO</span>
th: เปิดใช้งานตลอดเวลา <span class="pdpa--thailand-pro">PRO</span>

source: Enable PDPA Thailand
th: เปิดใช้งาน PDPA Thailand

source: Enable reject all button <span class="pdpa--thailand-pro">PRO</span>
th: แสดง ปุ่มปฏิเสธ <span class="pdpa--thailand-pro">PRO</span>

source: Enable settings button <span class="pdpa--thailand-pro">PRO</span>
th: แสดง ปุ่มตั้งค่า <span class="pdpa--thailand-pro">PRO</span>

source: Enables admin mode for displaying content exclusively to admins during testing.
th: เปิดใช้งานโหมดแอดมินสำหรับแสดงเนื้อหาเฉพาะแอดมินในระหว่างการทดสอบ

source: Enables management of tracking for Google Analytics.
th: เปิดใช้งานการจัดการการติดตามสำหรับ Google Analytics

source: Fade
th: ค่อยๆ ปรากฏขึ้นมา

source: FAQs
th: คำถามที่พบบ่อย

source: Force
th: บังคับ

source: Free
th: ฟรี

source: Free vs Pro
th: ฟรี vs โปร

source: Full Bottom
th: เต็มล่าง

source: Full Top
th: เต็มบน

source: General
th: ทั่วไป

source: Google analytic
th: Google Analytics

source: Hide close button <span class="pdpa--thailand-pro">PRO</span>
th: ซ่อนปุ่มปิด <span class="pdpa--thailand-pro">PRO</span>

source: I have some question
th: มีคำถาม ? อยากคุยกับเรา

source: Import/Export settings in JSON format.
th: นำเข้า/ส่งออกการตั้งค่าในรูปแบบ JSON

source: Includes a <b>Wizard Consent Message</b> feature.
th: รวมฟีเจอร์ข้อความยินยอมแบบ <b>Wizard</b>

source: License Price* You will save <b>300฿ off</b> the initial purchase price, and get <b>30% discount</b> when renewing the license.
th: ราคาพิเศษ* คุณจะประหยัดได้ <b>300฿</b> จากราคาซื้อครั้งแรก และได้รับ<b>ส่วนลด 30%</b> เมื่อทำการต่ออายุใบอนุญาต

source: Logo <span class="pdpa--thailand-pro">PRO</span>
th: โลโก้ <span class="pdpa--thailand-pro">PRO</span>

source: Main color
th: สีหลัก

source: Manage Consent Preferences
th: จัดการความเป็นส่วนตัว

source: Manages cookie expiration times and descriptions effectively.
th: จัดการการหมดอายุของคุกกี้และคำอธิบายได้อย่างมีประสิทธิภาพ

source: Max popup width <span class="pdpa--thailand-pro">PRO</span>
th: ความกว้างสูงสุดของป๊อปอัป <span class="pdpa--thailand-pro">PRO</span>

source: Maybe later
th: เอาไว้ทีหลัง

source: Messages
th: ข้อความ

source: Minimalist
th: มินิมอล

source: Mode <span class="pdpa--thailand-pro">PRO</span>
th: โหมด <span class="pdpa--thailand-pro">PRO</span>

source: Multi-language support for PolyLang and WPML.
th: รองรับหลายภาษา สำหรับ PolyLang และ WPML

source: Never ask again
th: ไม่ต้องแสดงอีก

source: Offers a mini popup mode post consent or after closing.
th: มีโหมดมินิป๊อปอัปหลังจากให้ความยินยอมหรือหลังจากปิด

source: OK, you deserve it!
th: ไปรีวิวเลย !

source: Only allow A-Z, a-z, -, _
th: รองรับตัวอักษร A-Z, a-z, -, _ เท่านั้น

source: Override popup templates.
th: เขียนไฟล์เพื่อทับเทมเพลตป๊อปอัพได้

source: PDPA Thailand - Policy Page
th: PDPA Thailand - นโยบายความเป็นส่วนตัว

source: Personalize popups with 4 modes, adjust 9 popup templates, apply background blur, add effects on popup load, and toggle between dark/light mode, plus much more.
th: ปรับแต่งป๊อปอัปด้วย 4 โหมด, ปรับแต่งเทมเพลตป๊อปอัป 9 แบบ, ใช้การเบลอพื้นหลัง, เพิ่มเอฟเฟกต์เมื่อโหลดป๊อปอัป, และสลับระหว่างโหมดมืด/สว่าง รวมทั้งฟีเจอร์อื่นๆ อีกมากมาย

source: Please confirm to delete this row ?
th: โปรดยืนยันการลบรายการนี้

source: Policy page
th: หน้า Policy

source: Popup effect <span class="pdpa--thailand-pro">PRO</span>
th: เอฟเฟกต์ป๊อปอัป <span class="pdpa--thailand-pro">PRO</span>

source: Popup layout <span class="pdpa--thailand-pro">PRO</span>
th: เลย์เอาต์ป๊อปอัป <span class="pdpa--thailand-pro">PRO</span>

source: Popup mode <span class="pdpa--thailand-pro">PRO</span>
th: โหมด <span class="pdpa--thailand-pro">PRO</span>

source: Premium Features
th: ฟีเจอร์ vs โปร

source: Privacy policy
th: นโยบายความเป็นส่วนตัว

source: Privacy Preferences
th: ตั้งค่าความเป็นส่วนตัว

source: Pro
th: โปร

source: Provides control over the settings and reject buttons, with options to disable auto consent.
th: ควบคุมการตั้งค่าและปุ่มปฏิเสธ โดยมีตัวเลือกในการปิดการยินยอมอัตโนมัติ

source: Provides the option to configure a policy page.
th: ให้ตัวเลือกในการตั้งค่าหน้านโยบาย

source: Reject
th: ปฏิเสธ

source: Reject All
th: ปฏิเสธ

source: Reject button <span class="pdpa--thailand-pro">PRO</span>
th: ปุ่มปฏิเสธ <span class="pdpa--thailand-pro">PRO</span>

source: Reset Cookie ID <a href="%s" class="pdpa--link" target="_blank"></a>
th: รีเซ็ตคุกกี้ ID <a href="%s" class="pdpa--link" target="_blank"></a>

source: Save
th: บันทึกการตั้งค่า

source: Save button <span class="pdpa--thailand-pro">PRO</span>
th: ปุ่มบันทึก <span class="pdpa--thailand-pro">PRO</span>

source: Save Settings
th: บันทึก

source: Select / Upload
th: เลือก / อัปโหลด

source: Settings
th: ตั้งค่า

source: Settings are Saved
th: บันทึกการตั้งค่าเรียบร้อยแล้ว

source: Settings button <span class="pdpa--thailand-pro">PRO</span>
th: ปุ่มการตั้งค่า <span class="pdpa--thailand-pro">PRO</span>

source: Sidebar layout <span class="pdpa--thailand-pro">PRO</span>
th: ข้อความใน Sidebar <span class="pdpa--thailand-pro">PRO</span>

source: Sidebar message
th: ข้อความใน Sidebar

source: Store consent logs, set a maximum retention period, and provide options for downloading, viewing, filtering, and displaying them in a table.
th: จัดเก็บบันทึกการยินยอม, ตั้งค่าระยะเวลาการเก็บรักษาสูงสุด, และให้ตัวเลือกในการดาวน์โหลด, ดู, กรอง, และแสดงในตาราง

source: Strictly necessary cookies description
th: รายละเอียด คุกกี้ที่จำเป็น

source: Strictly necessary cookies title
th: หัวข้อ คุกกี้ที่จำเป็น

source: Support
th: ขอความช่วยเหลือ

source: Support Thai PDPA law by manage cookie systematic and allow to ask consent from user
th: รองรับความต้องการของ PDPA มีระบบจัดการคุกกี้อย่างเป็นระบบ และสามารถขอความยินยอมจากผู้ใช้ก่อนที่จะเก็บข้อมูล

source: Supports the use of a <b>Cookie Wizard</b>, simplifying the installation of tracking.
th: รองรับการใช้ <b>Cookie Wizard</b> เพื่อให้ง่ายต่อการติดตั้งการติดตาม

source: This cookie name is not unique
th: มีการใช้ชื่อคุกกี้นี้แล้ว กรุณาตั้งชื่อใหม่

source: Upgrade 30% Off!
th: อัพเกรดทันทีลด 30% !

source: Upgrade now for 30% Off !
th: ซื้อเลย ! ตอนนี้ลดอีก 30%

source: Utilize a request form for revoking consent, with a notification system for submissions and tools to manage and display progress.
th: ใช้แบบฟอร์มคำขอเพื่อเพิกถอนการยินยอม พร้อมระบบแจ้งเตือนเมื่อผู้ใช้ส่งคำขอ และเครื่องมือในการจัดการและแสดงความคืบหน้า
